# Exporter IFC Properties

Source: https://www.revitapidocs.com/2026/3cd2f8c2-9f36-56e8-f2e7-f84086988d29.htm

---

| Exporter IFC Properties |
| --- |

The ExporterIFC type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ExportBaseQuantities | Identifies if the export should include IFC standard quantities currently supported by Revit. |
|  | FileName | The name of the IFC file being exported. |
|  | FileVersion | Identifies the file version being exported. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpaceBoundaryLevel | Identifies the level of space boundaries being exported. |
|  | WallAndColumnSplitting | Identifies if division of multi\-level walls and columns by levels should take place during this export. |

Top See Also

#### Reference

ExporterIFC Class Autodesk.Revit.DB.IFC Namespace